using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class HomeworkTwo : MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
//Создать переменную булл, в зависимости от ее значения создать массив int\float
//Создать переменную типа int\float. Заполнить массив так, чтобы каждый елемент был квадратом предыдущего.
//Создать и отловить исключение ( переполнение значения)
//Создать функцию на вход передать переменную ( которая в задании 2). После выполнения функции. Сделать пункт 3\4
//Создать функцию на вход передать переменную REF( которая в задании 2). После выполнения функции. Сделать пункт 3\4
//Создать функцию на вход передать переменную OUT( которая в задании 2). После выполнения функции. Сделать пункт 3\4
//Объявить структуру, которая будет содержать все элементы для предыдущих заданий.
//Записать ее в файл как в первом занятии.
//Записать ее в файл через сериализацию.
//Считать данные из файла.
//доп. задание
//Создать кнопки для управлением всем процесом из игры
